       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARRAYTRAVERSAL.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUMS.
           02 NUMBS PIC 999 OCCURS 5 TIMES.
       01 I PIC 99.

       PROCEDURE DIVISION.
       MOVE 99 TO NUMBS(1)
       MOVE 100 TO NUMBS(2)
       MOVE 328 TO NUMBS(3)
       MOVE 72 TO NUMBS(4)
       MOVE 324 TO NUMBS(5)

       PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
           DISPLAY "NUM("I") = " NUMBS(I)
       END-PERFORM.
       STOP RUN.
