       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARRAYAVERAGE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SCORES.
           05 SCORE PIC 99 OCCURS 5 TIMES.
       01 I PIC 9.
       01 TOTAL PIC 999 VALUE 0.
       01 AVERAGE PIC 99.

       PROCEDURE DIVISION.
       MOVE 60 TO SCORE(1).
       MOVE 60 TO SCORE(2).
       MOVE 60 TO SCORE(3).
       MOVE 60 TO SCORE(4).
       MOVE 60 TO SCORE(5).

       PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
           ADD SCORE(I) TO TOTAL
       END-PERFORM.

       DIVIDE TOTAL BY 5 GIVING AVERAGE.
       DISPLAY "AVERAGE = " AVERAGE.
       STOP RUN.
