       IDENTIFICATION DIVISION.
       PROGRAM-ID. COUNTPASSING.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SCORES.
           05 SCORE PIC 99 OCCURS 5 TIMES.
       01 I PIC 9.
       01 COUNTT PIC 9 VALUE 0.

       PROCEDURE DIVISION.
       MOVE 10 TO SCORE(1)
       MOVE 12 TO SCORE(2)
       MOVE 34 TO SCORE(3)
       MOVE 78 TO SCORE(4)
       MOVE 99 TO SCORE(5)

       PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
           IF SCORE(I) > 12
               ADD 1 TO COUNTT
           END-PERFORM.

           DISPLAY "NUMBERS ABOVE 12: " COUNTT
           STOP RUN.
